using System;

namespace CSharpEduLib.Content.Lectures.Module_1_Basics.Lecture_1_1.Exercises.Exercise_1_HelloWorld
{
    /// <summary>
    /// Упражнение 1: Hello World
    /// 
    /// Задание: Напишите программу, которая выводит на экран "Привет, мир!"
    /// 
    /// Ожидаемый результат:
    /// Привет, мир!
    /// 
    /// Подсказка: Используйте Console.WriteLine() для вывода текста
    /// </summary>
    public class StudentSolution
    {
        /// <summary>
        /// Основной метод упражнения
        /// TODO: Реализуйте вывод "Привет, мир!" на консоль
        /// </summary>
        public static void Run()
        {
            // TODO: Замените эту строку на свою реализацию
            throw new NotImplementedException("Реализуйте этот метод");
        }
    }
}
