# Лекция 1.1 — Введение в C#

В этой лекции вы узнаете об истории и особенностях языка C#, создадите свою первую программу и научитесь работать с консольным вводом/выводом.

## Цели
- Понять назначение .NET Framework и роль C#
- Освоить базовую структуру консольного приложения
- Научиться компилировать и запускать программы

## Пример кода: Hello, World!
```csharp
using System;
class Program
{
    static void Main()
    {
        Console.WriteLine("Hello, World!");
    }
}
```

## Задания
1) Напишите программу, которая выводит вашу фамилию и имя в две строки
2) Напишите программу, которая выводит сумму двух чисел 2 и 3
