using System;

namespace CSharpEduLib.Content.Lectures.Module_1_Basics.Lecture_1_1.Exercises.Exercise_2_MultipleLines
{
    /// <summary>
    /// Упражнение 2: Многострочный вывод
    /// 
    /// Задание: Напишите программу, которая выводит три строки:
    /// Это первая строка
    /// Это вторая строка
    /// Это третья строка
    /// 
    /// Подсказка: Используйте Console.WriteLine() три раза
    /// </summary>
    public class StudentSolution
    {
        /// <summary>
        /// Основной метод упражнения
        /// TODO: Реализуйте вывод трёх строк на консоль
        /// </summary>
        public static void Run()
        {
            // TODO: Замените эту строку на свою реализацию
            throw new NotImplementedException("Реализуйте этот метод");
        }
    }
}